{
    "model_toggle_button": "Load or Offload the model. The function of this button changes depending on whether a model is currently loaded.",
    "settings_button": "Open the main settings window.",
    "show_llm_log_button": "Show or hide the LLM and system log window. This is useful for debugging.",
    "clear_chat_button": "Clears the main chat display text. This does not delete the chat log files.",
    "clear_chat_folder_button": "Deletes all saved chat log files from the chat directory.",
    "terminal_button": "Opens a new system terminal in the directory specified in UI Settings.",
    "job_dropdown": "Select a job to be manually run with the 'Run' button.",
    "oss_tool_dropdown": "Select an OSS Tool to be manually run with the 'Run' button.",
    "theme_dropdown": "Select a color theme for the application.",
    "font_increase_button": "Increase the application-wide font size.",
    "font_decrease_button": "Decrease the application-wide font size.",
    "send_button": "Send the message to the model (Ctrl+Enter).",
    "copy_button": "Copies the last assistant response to the clipboard.",
    "stop_button": "Stops the current AI response generation.",
    "save_all_settings_button": "Save all changes made in the settings window.",
    "cancel_settings_button": "Close the settings window without saving changes.",
    "clear_chat_directory_button": "Permanently delete all files in the chat directory.",
    "clear_deltas_directory_button": "Permanently delete all files in the deltas directory.",
    "clear_metrics_logs_button": "Permanently delete all files in the metrics_logs directory.",
    "force_memory_cleanup_button": "Manually trigger Python's garbage collector to free up memory.",
    "export_system_info_button": "Export system and application information to a text file for debugging.",
    "test_model_performance_button": "Run a benchmark to test the model's performance (Temporarily Disabled).",
    "validate_directories_button": "Check if all configured directories exist.",
    "change_model_button": "Open the model settings to change the loaded model and its parameters.",
    "prompt_builder_button": "Open the System Prompt Builder to configure the AI's core instructions.",
    "personality_button": "Open the Personality Editor to adjust the AI's traits with sliders.",
    "job_manager_button": "Open the Job Manager to create, schedule, and manage automation jobs.",
    "oss_tool_button": "Open the OSS Tool Editor to create and manage tools for the AI.",
    "memory_button": "Open the Memory Manager to view and search chat history."
}
